<template>
  <div class="help-sub2">
    <div class="container">
      <h3>
        フォーム編集画面
      </h3>
      <img src="sample.png" width="800" height="600">
      <dl>
        <dt>ステータス</dt>
        <dd>
          フォームの状態を表示します。
          <ul>
            <li>無効：フォームが表示されない状態</li>
            <li>有効：フォームが表示される状態</li>
            <li>停止：フォームが停止状態で、メッセージが表示される状態</li>
          </ul>
        </dd>
        <dt>フォーム名</dt>
        <dd>フォームの名称。フォーム画面には表示されない。</dd>
        <dt>タイトル</dt>
        <dd>フォームのタイトル。フォーム画面に表示される内容。</dd>
        <dt>キャンセル後遷移先URL</dt>
        <dd>フォーム入力画面で「キャンセル」をクリックした際に遷移するページのURLを指定する</dd>
        <dt>完了後遷移先URL</dt>
        <dd>フォーム完了画面から「完了」をクリックした際に遷移するページのURLを指定する</dd>
        <dt>フォーム入力画面メッセージ</dt>
        <dd>フォーム入力画面の冒頭に表示する文言を入力（HTML可）</dd>
        <dt>フォーム確認画面メッセージ</dt>
        <dd>フォーム確認画面の冒頭に表示する文言を入力（HTML可）</dd>
        <dt>フォーム完了画面メッセージ</dt>
        <dd>フォーム完了画面のに表示する文言を入力（HTML可）</dd>
        <dt>フォーム停止時メッセージ</dt>
        <dd>フォーム停止時に表示する文言を入力（HTML可）</dd>
        <dt>フォーム項目</dt>
        <dd>
          ユーザーに入力してもらう項目
          <dl>
            <dt>No.</dt>
            <dd>フォーム項目番号</dd>
            <dt>項目名</dt>
            <dd>画面に表示するフォーム項目の名前</dd>
            <dt>項目ID</dt>
            <dd>内部でフォーム項目を識別するためのID（画面には表示されない）</dd>
            <dt>型</dt>
            <dd>フォーム項目の形を指定</dd>
            <dt>操作</dt>
            <dd>
              <ul>
                <li>編集: フォーム項目の設定を編集する</li>
                <li>削除: フォーム項目を削除する</li>
              </ul>
            </dd>
          </dl>
        </dd>
        <dt>転送タスク</dt>
        <dd>Sformに送られてきたデータを基に外部にデータを送信する処理（転送）を選択・設定する</dd>
      </dl>
    </div>
  </div>
</template>
<script>
export default {
  name: 'FormEdit'
}
</script>
